/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   MakeArray.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sb <sb@student.42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/10/22 12:44:29 by ipepelia          #+#    #+#             */
/*   Updated: 2019/11/11 13:32:08 by sb               ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "fillit.h"

/* Для унификации месторасположения фигур сдвигаем их к левому-верхнему краю. */

void	MinArray(int **arr, int n) 
{
	int	x;
	int	y;
	int	*ar;

	ar = *arr;
	x = ar[n];
	y = ar[n + 1];
	while (n < 6)
	{
		if ((ar[n] > ar[n + 2]) && ((n == 0) || ((n % 2) == 0)))
			x = ar[n + 2];
		if ((ar[n] > ar[n + 2]) && ((n % 2) != 0))
			y = ar[n + 2];
		n++;
	}
	n = 0;
	while (n < 7)
	{
		ar[n] = ar[n] - x;
		ar[n + 1] = ar[n + 1] - y;
		n += 2;
	}
}

/* Создаем массив с координатами каждой валидной фигуры. */

void	MakeArray(char **s, int *arr)
{
	int i;
	int j;
	int n;

	i = 0;
	n = 0;
	while (i < 4)
	{
		j = 0;
		while (s[i][j])
		{
			if (s[i][j] == '#' && n < 7)
			{
				arr[n] = j;
				arr[n + 1] = i;
				n += 2;
			}
			j++;
		}
		i++;
	}
	MinArray(&arr, 0);
}